--汉化by李清照
--QQ2571781314
--交流群262244016

 local fuckthemtext = {
	"       绿色玩你妈官匹           ",
	"我直接杀你妈。",
	"操完他妈还要帮我口。",
	"是不是没钱去5e b5 完美，支付宝给爸爸爸爸给你转钱让你去平台玩。没挂来你吗了个皮官匹？是不是来给大哥送吗吗？。",
	"我看你有几个麻麻送给我们，小几把臭狗",
	"小比绿色玩家你叫你吗叫，火速给爸爸把你的黑b嘴闭上，不然今晚12点你吗必死无疑",
	"咋的？破防了？这就破防了？",
	"会不会打字？不要在打字暴露你的智商了小几把臭狗",
	"啧啧啧，又开始破防了，殊不知你吗被我r了几万遍还嫌不够",
	"你姐姐蜜桃臀真大，天天被我刨槽菊花，还说要拉上你麻麻一起给我双飞，还让你爸爸在旁边观战",
	"你麻麻说你这个不孝子天天骂你的爹爹门，说晚上就把你个小臂崽子高丸割掉煮了吃",
	"啧啧啧，又破防了，你们一天要破防多少次，小臂崽子，不会打字就别打，暴露智商。",
	"打字能不能快点小几把东西，你知不知道你吗吗在家里被你野爹我草多少次，还搁着了打你吗csgo，打又打不过，还他妈买不起挂？没挂玩你妈官匹呢？是不是来送吗？你送你继续，你骂我一句送个吗，我看你有几个吗",
	"是是是，你说的都是，我直接一波反弹顺便草拟吗100次，你吗的比水直接流一地让我接着给你们补充蛋白质。",
	"绿色玩家你听我说，你听你吗听，你爹爹我说的话你配听么，我直接杀你吗，给你吗杀了煮了吃喂你亲爹，你爹还说味道不错加点酱油，我直接用你吗碧水给你爹沾着吃，吃的津津有味顺便还来了口猪尿说这辈子都没吃过这么好的东西",
	"你这个不孝子啊，别叫了，爹爹怎么就跟你吗生出你这么个狗玩意，还是你姐姐听话，天天帮你爹爹做口交，舒服的一批哦",
	"开始了开始了，你急了你急了，你吗直接上坟了。",
	"别打字了，打字又慢，骂又骂不过，显得像极了没有班上的小丑",
	"说真的火速把支付宝账号给爸爸，爸爸给你转钱买个挂，反正你都来送麻了，还有什么畏惧",
	"还是那句话，你今天说几句话，就给你爹爹们送几个吗，你只有一个吗，难道你要把你户口本全部送给你的爹爹们？真是个大孝子，你可真听话",
	"那天晚上艹你吗艹的不够你吗说下次还要带上你一起艹她，你看看你吗对你多好，你这个不孝子还在这里骂爹爹，小心爹爹下次不带你一起艹你麻麻跟你姐姐",
	"不要急我的乖儿子，这是你应该得到的奖励，虽然你麻麻的比已经被你野爹我艹松了，但是你那小牙签还是会有点感觉得",
	"绿色玩家来送吗，结果只有一个吗，户口本送完裤头都没了，最后只能破防了，破防完了还急了，急的开始骂人了，结果骂人骂不过开始骂爹爹了，呜呜呜，不孝子",
	"是是是，儿子说什么都对，可是你吗吗却不能或者见到你了，呜呜呜。",
	"呜呜呜，好好孝敬你爹爹我好么乖儿子。",
	"绿色玩家全家暴毙，完毕！"
};


local last_spam  = globals.TickCount()
local spam_count = 0
local i = 1
function AutoSpamChinese()
   if globals.TickCount() - last_spam > 66 then
		client.ChatSay(  tostring( fuckthemtext[i] )  );
		last_spam = globals.TickCount()
		i = i + 1
	    if i > 26 then
			i = 1
		end
   end
end

callbacks.Register( "Draw", "AutoSpamChinese", AutoSpamChinese);




